{"class_name": "Model", "keras_version": "1.0.7", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 3, 128, 160], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "PredNet", "config": {"trainable": true, "dim_ordering": "th", "pixel_max": 1.0, "Ahat_filt_sizes": [3, 3, 3, 3], "R_filt_sizes": [3, 3, 3, 3], "unroll": false, "consume_less": "cpu", "input_length": null, "LSTM_inner_activation": "hard_sigmoid", "output_mode": "error", "stateful": false, "error_activation": "relu", "A_activation": "relu", "A_filt_sizes": [3, 3, 3], "stack_sizes": [3, 48, 96, 192], "name": "prednet_1", "go_backwards": false, "extrap_start_time": null, "input_dim": null, "R_stack_sizes": [3, 48, 96, 192], "return_sequences": true, "LSTM_activation": "tanh"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "prednet_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, "trainable": false, "name": "timedistributed_1"}, "inbound_nodes": [[["prednet_1", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["timedistributed_1", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}}